# <font color="purple"><h3 align="center">Pandas Concatenate Tutorial</h3></font>

## <font color='blue'>Basic Concatenation</font>

In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [3]:
df = pd.concat([india_weather, us_weather])
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

## <font color='blue'>Ignore Index</font>

In [4]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

## <font color='blue'>Concatenation And Keys</font>

In [26]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           30
us    0  new york        68           21
      1   chicago        65           14
      2   orlando        75           35

In [27]:
df.loc["us"]

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [28]:
df.loc["india"]

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

## <font color='blue'>Concatenation Using Index</font>

In [16]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [17]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [24]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

## <font color='blue'>Concatenate dataframe with series</font>

In [20]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [23]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

In [17]:
import pandas as pd
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87],
         "sub":["s","a","b","l","p"]
        }
data2={'Name':['Rahul','Anil','Paresh','Vedant','Priyang'],
         'Marks':[98,99,89,85,87]
      }

In [18]:
print(data1)
print(data2)

{'Name': ['Priyang', 'Aadhya', 'Vedant', 'Parshv', 'krisha'], 'Marks': [98, 99, 89, 85, 87], 'sub': ['s', 'a', 'b', 'l', 'p']}
{'Name': ['Rahul', 'Anil', 'Paresh', 'Vedant', 'Priyang'], 'Marks': [98, 99, 89, 85, 87]}

In [23]:
d1=pd.DataFrame(data1,index=[0,1,2,3,4])
d2=pd.DataFrame(data2,index=[0,1,14,15,2])
print(d1)
print(d2)

      Name  Marks sub
0  Priyang     98   s
1   Aadhya     99   a
2   Vedant     89   b
3   Parshv     85   l
4   krisha     87   p
       Name  Marks
0     Rahul     98
1      Anil     99
14   Paresh     89
15   Vedant     85
2   Priyang     87

In [24]:
df=pd.concat([d1,d2],axis=1,join="outer")
df

       Name  Marks  sub     Name  Marks
0   Priyang   98.0    s    Rahul   98.0
1    Aadhya   99.0    a     Anil   99.0
2    Vedant   89.0    b  Priyang   87.0
3    Parshv   85.0    l      NaN    NaN
4    krisha   87.0    p      NaN    NaN
14      NaN    NaN  NaN   Paresh   89.0
15      NaN    NaN  NaN   Vedant   85.0

In [4]:
import pandas as pd
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }
data3 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.DataFrame(data3)

d4=pd.Series(["AB","AA","AB","BA","BB"],name="Grades")
# print(d4)


df=pd.concat([df1,df2,df3,d4],axis=1)
print(df)

      Name  Marks     Name  Marks     Name  Marks Grades
0  Priyang     98  Priyang     98  Priyang     98     AB
1   Aadhya     99   Aadhya     99   Aadhya     99     AA
2   Vedant     89   Vedant     89   Vedant     89     AB
3   Parshv     85   Parshv     85   Parshv     85     BA
4   krisha     87   krisha     87   krisha     87     BB

In [33]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

In [36]:
res=pd.concat([df1,df2],keys=["india","us"],names=["L1","L2"])
res

             Name  Marks
L1    L2
india 0   Priyang     98
      1    Aadhya     99
      2    Vedant     89
      3    Parshv     85
      4    krisha     87
us    0   Priyang     98
      1    Aadhya     99
      2    Vedant     89
      3    Parshv     85
      4    krisha     87

# verify_interity

verify_interity:-verify_interity check whether the new concatenated axis contains duplicates

In [1]:
import pandas as pd
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }

data2 = {'Name1':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks1':[98,99,89,85,87]
        }

df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[10,11,12,13,14])

res=pd.concat([df1,df2],axis="columns",verify_integrity=True,ignore_index=True)
res

          0     1        2     3
0   Priyang  98.0      NaN   NaN
1    Aadhya  99.0      NaN   NaN
2    Vedant  89.0      NaN   NaN
3    Parshv  85.0      NaN   NaN
4    krisha  87.0      NaN   NaN
10      NaN   NaN  Priyang  98.0
11      NaN   NaN   Aadhya  99.0
12      NaN   NaN   Vedant  89.0
13      NaN   NaN   Parshv  85.0
14      NaN   NaN   krisha  87.0

# sort

In [9]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]
        }
data2 = {'Grade':['Priyang','Aadhya','Vedant','Parshv','krisha'],
        }

df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[10,11,12,13,14])

res=pd.concat([df1,df2],axis=1,sort=True)
res.set_index("Name")

         Marks    Grade
Name
Priyang   98.0      NaN
Aadhya    99.0      NaN
Vedant    89.0      NaN
Parshv    85.0      NaN
krisha    87.0      NaN
NaN        NaN  Priyang
NaN        NaN   Aadhya
NaN        NaN   Vedant
NaN        NaN   Parshv
NaN        NaN   krisha